---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Element..::..GetChangeTypeParameter Method
Element Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | GetChangeTypeParameter(ElementId) | Returns ChangeType associated with a change in a parameter's value |
|  | GetChangeTypeParameter(Parameter) | Returns ChangeType associated with a change in a parameter's value |

# See Also

Element Class

Element Members

Autodesk.Revit.DB Namespace